Feature: Обработване на поръчка

  Background: Потребителят трябва да е логнат с профил на служител

    Scenario: Успешно обработване на поръчка
      Given клиентът е направил поръчка с артикул "Пица Маргарита"
      When служителят приеме поръчката
      Then поръчката трябва да бъде маркирана като "Обработва се"

    Scenario: Обработване на поръчка с артикул, който не е наличен
      Given клиентът е направил поръчка с артикул "Суши сет"
      When служителят опита да приеме поръчката
      And артикулът не е наличен
      Then системата трябва да смени статуса на поръчката на "Някой от артикулите не са налични"

    Scenario: Обработване на поръчка с артикул на промоция
      Given клиентът е направил поръчка с артикул "Кафе", който е с цена 4 лева и на промоция 25%
      When служителят приеме поръчката
      Then поръчката трябва да бъде маркирана като "Обработва се"
      And цената на поръчката трябва да включва промоционалната отстъпка

    Scenario: Успешно отказване на поръчка
      Given клиентът е направил поръчка с артикули "Кафе", "Кафе" и "Кока-кола 500мл"
      And поръчката е в статус "Обработва се"
      When клиентът уведоми че иска да откаже поръчката и служителят я откаже
      Then поръчката трябва да бъде маркирана като "Отменена"

    Scenario: Успешна промяна на поръчка
      Given клиентът поиска промяна на поръчка, която е направил само с един артикул
      And поръчката е в статус "Обработва се"
      Then служителят прави нужната промяна като заменя поръчаният артикул с "Фанта 500мл"
      And статусът на поръчката трябва да остане "Обработва се"