Feature: Промоция на артикул

  Background: Потребителят трябва да е логнат с профил на служител

    Scenario: Успешно задаване на промоция на артикул
      Given служителят избира артикул с идентификационен номер 1
      When служителят зададе процент на промоцията 25
      Then артикулът трябва да бъде обозначен, че е в промоция

    Scenario: Задаване на промоция на артикул, който не е наличен
      Given служителят избира артикул с идентификационен номер 2
      And избраният артикулът не е наличен
      When служителят зададе процент на промоцията 25
      Then служителят трябва да бъде уведомен, че "Не е възможно да се зададе промоционална цена на артикули, които не са в наличност"

    Scenario: Успешно премахване на всички промоции
      When служителят натиска бутон Премахни Всички Промоции
      Then системата премахва промоциите на всички артикули

    Scenario: Задаване на промоция на артикул, с невалиден промоционален процент
      Given служителят избира артикул с идентификационен номер 1
      When служителят зададе процент на промоцията -10
      Then служителят трябва да бъде уведомен, че "Промоционалният процент трябва да е положително число с максимална стойност 99"

    Scenario: Задаване на промоция на няколко артикула едновременно
      Given служителят маркира артикулите "Кафе", "Фанта 500мл", "Кока-кола 500мл"
      When служителят зададе процент на промоцията 25 наведнъж на всички
      Then всички артикули трябва да станат промоционални с процент 25
